/*
 * Copyright 2002-2016 the original author or authors.
 *
 * Licensed under the Apache License, Version 2.0 (the "License"); you may not use this file except
 * in compliance with the License. You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software distributed under the License
 * is distributed on an "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express
 * or implied. See the License for the specific language governing permissions and limitations under
 * the License.
 */

package com.sf.practice.temptest;

import java.io.File;
import java.io.FileOutputStream;
import java.io.IOException;
import java.util.Random;

public class Test1 {

  public static void main(String[] args) throws IOException {
    String s =
        ";̷̸̨̀͒̏̃ͦ̈́̾̀́̎͢҉̵̶͚̼͉͖̺̥͔͇̰̹̮͙͉̻̼̭̻͕̮͇ͨͬͪ͗̇̑̽͋̀̋̊͌ͧͨͭ̓̅͐ͥ̂̔̊ͧ͊҉̶̵̷̞̩̦̳̺̳̬̬̩̣̫͇̯̥͖͍͕̠̦̼̗ͯ̽͌̔ͪͯ́́͋̍ͨ̿̿̎͒ͤ̓̅̀͂ͧ͋̏ͫͣ̔͘͜͠͏̶̵̸̸̸̶̸̶̧̧̡̢̡̛̛̥̺͓̘̺͎̜̥͕͈̝̫͎̺̮̱̤̠̠͖̳̻̥̣̪͍͕͇̮͙̹̪͈̼̩̯̪͕̯̫̹̥͔͚͙̦̩͚̭̥͉̰̝̺͍̭̤̹̘̮̪͖͖͉̲̯͕̜̭̙̺̬̘͉̻͍̝̦͖̣̜͖̱͚̞̞̝̝̭̖͕͓͕͇̖̜̭̠͖̼̯̼̠̹͔̲͔̟͕̱̘̹̗͙̪̥̳͓̳͖̞̻͉͈̮̯̲̘̱̱̞̜̖̞̣̱ͮͧͫ͂͒ͤͣ̌̽ͨͪ͒̄̄̉̒̊ͩ̅͆̒̎̇̆͆ͪ̈́͛̉̍̏́̄̈́̽̔̍̎̂ͬ̆͗͌̔ͫ͆̀́͑̈́ͤ́ͯ̇ͧ̾͂̐̋̉̊ͦͥͫͧ͆ͨ̽̒̃͊̒̎͊̇̽̓̒ͬ̐̈́̀́́̍̈́̆̉ͭͪ̾ͭ̈́͛͑̽͐ͬ̈ͧͧ̍̐̑̓ͥ̔̾͐́̎̎͛ͮ͑ͤ̃̉ͦ̍͒ͩ̃̌̎͗̈́̐̉͐͐͌̄̀̓͆̉̌̎͂ͨͩͬ̾̊͋ͪ̎̑̀͘̚͘͘̚͘͘͘̕͟͟͢͟͟͟͜͝͠͞͝͝͝͝͡ͅͅͅͅ͏͏̡̡̛̙̣͉̪̬̗̳̱̤̥̪̮̮̟̥̠ͯ̓̂́͐̄̉̇ͣ́̚͜͟;̷̸̨̀͒̏̃ͦ̈́̾̀́̎͢҉̵̶͚̼͉͖̺̥͔͇̰̹̮͙͉̻̼̭̻͕̮͇ͨͬͪ͗̇̑̽͋̀̋̊͌ͧͨͭ̓̅͐ͥ̂̔̊ͧ͊҉̶̵̷̞̩̦̳̺̳̬̬̩̣̫͇̯̥͖͍͕̠̦̼̗ͯ̽͌̔ͪͯ́́͋̍ͨ̿̿̎͒ͤ̓̅̀͂ͧ͋̏ͫͣ̔͘͜͠͏̶̵̸̸̸̶̸̶̧̧̡̢̡̛̛̥̺͓̘̺͎̜̥͕͈̝̫͎̺̮̱̤̠̠͖̳̻̥̣̪͍͕͇̮͙̹̪͈̼̩̯̪͕̯̫̹̥͔͚͙̦̩͚̭̥͉̰̝̺͍̭̤̹̘̮̪͖͖͉̲̯͕̜̭̙̺̬̘͉̻͍̝̦͖̣̜͖̱͚̞̞̝̝̭̖͕͓͕͇̖̜̭̠͖̼̯̼̠̹͔̲͔̟͕̱̘̹̗͙̪̥̳͓̳͖̞̻͉͈̮̯̲̘̱̱̞̜̖̞̣̱ͮͧͫ͂͒ͤͣ̌̽ͨͪ͒̄̄̉̒̊ͩ̅͆̒̎̇̆͆ͪ̈́͛̉̍̏́̄̈́̽̔̍̎̂ͬ̆͗͌̔ͫ͆̀́͑̈́ͤ́ͯ̇ͧ̾͂̐̋̉̊ͦͥͫͧ͆ͨ̽̒̃͊̒̎͊̇̽̓̒ͬ̐̈́̀́́̍̈́̆̉ͭͪ̾ͭ̈́͛͑̽͐ͬ̈ͧͧ̍̐̑̓ͥ̔̾͐́̎̎͛ͮ͑ͤ̃̉ͦ̍͒ͩ̃̌̎͗̈́̐̉͐͐͌̄̀̓͆̉̌̎͂ͨͩͬ̾̊͋ͪ̎̑̀͘̚͘͘̚͘͘͘̕͟͟͢͟͟͟͜͝͠͞͝͝͝͝͡ͅͅͅͅ͏͏̡̡̛̙̣͉̪̬̗̳̱̤̥̪̮̮̟̥̠ͯ̓̂́͐̄̉̇ͣ́̚͜͟;̷̸̨̀͒̏̃ͦ̈́̾̀́̎͢҉̵̶͚̼͉͖̺̥͔͇̰̹̮͙͉̻̼̭̻͕̮͇ͨͬͪ͗̇̑̽͋̀̋̊͌ͧͨͭ̓̅͐ͥ̂̔̊ͧ͊҉̶̵̷̞̩̦̳̺̳̬̬̩̣̫͇̯̥͖͍͕̠̦̼̗ͯ̽͌̔ͪͯ́́͋̍ͨ̿̿̎͒ͤ̓̅̀͂ͧ͋̏ͫͣ̔͘͜͠͏̶̵̸̸̸̶̸̶̧̧̡̢̡̛̛̥̺͓̘̺͎̜̥͕͈̝̫͎̺̮̱̤̠̠͖̳̻̥̣̪͍͕͇̮͙̹̪͈̼̩̯̪͕̯̫̹̥͔͚͙̦̩͚̭̥͉̰̝̺͍̭̤̹̘̮̪͖͖͉̲̯͕̜̭̙̺̬̘͉̻͍̝̦͖̣̜͖̱͚̞̞̝̝̭̖͕͓͕͇̖̜̭̠͖̼̯̼̠̹͔̲͔̟͕̱̘̹̗͙̪̥̳͓̳͖̞̻͉͈̮̯̲̘̱̱̞̜̖̞̣̱ͮͧͫ͂͒ͤͣ̌̽ͨͪ͒̄̄̉̒̊ͩ̅͆̒̎̇̆͆ͪ̈́͛̉̍̏́̄̈́̽̔̍̎̂ͬ̆͗͌̔ͫ͆̀́͑̈́ͤ́ͯ̇ͧ̾͂̐̋̉̊ͦͥͫͧ͆ͨ̽̒̃͊̒̎͊̇̽̓̒ͬ̐̈́̀́́̍̈́̆̉ͭͪ̾ͭ̈́͛͑̽͐ͬ̈ͧͧ̍̐̑̓ͥ̔̾͐́̎̎͛ͮ͑ͤ̃̉ͦ̍͒ͩ̃̌̎͗̈́̐̉͐͐͌̄̀̓͆̉̌̎͂ͨͩͬ̾̊͋ͪ̎̑̀͘̚͘͘̚͘͘͘̕͟͟͢͟͟͟͜͝͠͞͝͝͝͝͡ͅͅͅͅ͏͏̡̡̛̙̣͉̪̬̗̳̱̤̥̪̮̮̟̥̠ͯ̓̂́͐̄̉̇ͣ́̚͜͟;̷̸̨̀͒̏̃ͦ̈́̾̀́̎͢҉̵̶͚̼͉͖̺̥͔͇̰̹̮͙͉̻̼̭̻͕̮͇ͨͬͪ͗̇̑̽͋̀̋̊͌ͧͨͭ̓̅͐ͥ̂̔̊ͧ͊҉̶̵̷̞̩̦̳̺̳̬̬̩̣̫͇̯̥͖͍͕̠̦̼̗ͯ̽͌̔ͪͯ́́͋̍ͨ̿̿̎͒ͤ̓̅̀͂ͧ͋̏ͫͣ̔͘͜͠͏̶̵̸̸̸̶̸̶̧̧̡̢̡̛̛̥̺͓̘̺͎̜̥͕͈̝̫͎̺̮̱̤̠̠͖̳̻̥̣̪͍͕͇̮͙̹̪͈̼̩̯̪͕̯̫̹̥͔͚͙̦̩͚̭̥͉̰̝̺͍̭̤̹̘̮̪͖͖͉̲̯͕̜̭̙̺̬̘͉̻͍̝̦͖̣̜͖̱͚̞̞̝̝̭̖͕͓͕͇̖̜̭̠͖̼̯̼̠̹͔̲͔̟͕̱̘̹̗͙̪̥̳͓̳͖̞̻͉͈̮̯̲̘̱̱̞̜̖̞̣̱ͮͧͫ͂͒ͤͣ̌̽ͨͪ͒̄̄̉̒̊ͩ̅͆̒̎̇̆͆ͪ̈́͛̉̍̏́̄̈́̽̔̍̎̂ͬ̆͗͌̔ͫ͆̀́͑̈́ͤ́ͯ̇ͧ̾͂̐̋̉̊ͦͥͫͧ͆ͨ̽̒̃͊̒̎͊̇̽̓̒ͬ̐̈́̀́́̍̈́̆̉ͭͪ̾ͭ̈́͛͑̽͐ͬ̈ͧͧ̍̐̑̓ͥ̔̾͐́̎̎͛ͮ͑ͤ̃̉ͦ̍͒ͩ̃̌̎͗̈́̐̉͐͐͌̄̀̓͆̉̌̎͂ͨͩͬ̾̊͋ͪ̎̑̀͘̚͘͘̚͘͘͘̕͟͟͢͟͟͟͜͝͠͞͝͝͝͝͡ͅͅͅͅ͏͏̡̡̛̙̣͉̪̬̗̳̱̤̥̪̮̮̟̥̠ͯ̓̂́͐̄̉̇ͣ́̚͜͟;̷̸̨̀͒̏̃ͦ̈́̾̀́̎͢҉̵̶͚̼͉͖̺̥͔͇̰̹̮͙͉̻̼̭̻͕̮͇ͨͬͪ͗̇̑̽͋̀̋̊͌ͧͨͭ̓̅͐ͥ̂̔̊ͧ͊҉̶̵̷̞̩̦̳̺̳̬̬̩̣̫͇̯̥͖͍͕̠̦̼̗ͯ̽͌̔ͪͯ́́͋̍ͨ̿̿̎͒ͤ̓̅̀͂ͧ͋̏ͫͣ̔͘͜͠͏̶̵̸̸̸̶̸̶̧̧̡̢̡̛̛̥̺͓̘̺͎̜̥͕͈̝̫͎̺̮̱̤̠̠͖̳̻̥̣̪͍͕͇̮͙̹̪͈̼̩̯̪͕̯̫̹̥͔͚͙̦̩͚̭̥͉̰̝̺͍̭̤̹̘̮̪͖͖͉̲̯͕̜̭̙̺̬̘͉̻͍̝̦͖̣̜͖̱͚̞̞̝̝̭̖͕͓͕͇̖̜̭̠͖̼̯̼̠̹͔̲͔̟͕̱̘̹̗͙̪̥̳͓̳͖̞̻͉͈̮̯̲̘̱̱̞̜̖̞̣̱ͮͧͫ͂͒ͤͣ̌̽ͨͪ͒̄̄̉̒̊ͩ̅͆̒̎̇̆͆ͪ̈́͛̉̍̏́̄̈́̽̔̍̎̂ͬ̆͗͌̔ͫ͆̀́͑̈́ͤ́ͯ̇ͧ̾͂̐̋̉̊ͦͥͫͧ͆ͨ̽̒̃͊̒̎͊̇̽̓̒ͬ̐̈́̀́́̍̈́̆̉ͭͪ̾ͭ̈́͛͑̽͐ͬ̈ͧͧ̍̐̑̓ͥ̔̾͐́̎̎͛ͮ͑ͤ̃̉ͦ̍͒ͩ̃̌̎͗̈́̐̉͐͐͌̄̀̓͆̉̌̎͂ͨͩͬ̾̊͋ͪ̎̑̀͘̚͘͘̚͘͘͘̕͟͟͢͟͟͟͜͝͠͞͝͝͝͝͡ͅͅͅͅ͏͏̡̡̛̙̣͉̪̬̗̳̱̤̥̪̮̮̟̥̠ͯ̓̂́͐̄̉̇ͣ́̚͜͟;̷̸̨̀͒̏̃ͦ̈́̾̀́̎͢҉̵̶͚̼͉͖̺̥͔͇̰̹̮͙͉̻̼̭̻͕̮͇ͨͬͪ͗̇̑̽͋̀̋̊͌ͧͨͭ̓̅͐ͥ̂̔̊ͧ͊҉̶̵̷̞̩̦̳̺̳̬̬̩̣̫͇̯̥͖͍͕̠̦̼̗ͯ̽͌̔ͪͯ́́͋̍ͨ̿̿̎͒ͤ̓̅̀͂ͧ͋̏ͫͣ̔͘͜͠͏̶̵̸̸̸̶̸̶̧̧̡̢̡̛̛̥̺͓̘̺͎̜̥͕͈̝̫͎̺̮̱̤̠̠͖̳̻̥̣̪͍͕͇̮͙̹̪͈̼̩̯̪͕̯̫̹̥͔͚͙̦̩͚̭̥͉̰̝̺͍̭̤̹̘̮̪͖͖͉̲̯͕̜̭̙̺̬̘͉̻͍̝̦͖̣̜͖̱͚̞̞̝̝̭̖͕͓͕͇̖̜̭̠͖̼̯̼̠̹͔̲͔̟͕̱̘̹̗͙̪̥̳͓̳͖̞̻͉͈̮̯̲̘̱̱̞̜̖̞̣̱ͮͧͫ͂͒ͤͣ̌̽ͨͪ͒̄̄̉̒̊ͩ̅͆̒̎̇̆͆ͪ̈́͛̉̍̏́̄̈́̽̔̍̎̂ͬ̆͗͌̔ͫ͆̀́͑̈́ͤ́ͯ̇ͧ̾͂̐̋̉̊ͦͥͫͧ͆ͨ̽̒̃͊̒̎͊̇̽̓̒ͬ̐̈́̀́́̍̈́̆̉ͭͪ̾ͭ̈́͛͑̽͐ͬ̈ͧͧ̍̐̑̓ͥ̔̾͐́̎̎͛ͮ͑ͤ̃̉ͦ̍͒ͩ̃̌̎͗̈́̐̉͐͐͌̄̀̓͆̉̌̎͂ͨͩͬ̾̊͋ͪ̎̑̀͘̚͘͘̚͘͘͘̕͟͟͢͟͟͟͜͝͠͞͝͝͝͝͡ͅͅͅͅ͏͏̡̡̛̙̣͉̪̬̗̳̱̤̥̪̮̮̟̥̠ͯ̓̂́͐̄̉̇ͣ́̚͜͟;̷̸̨̀͒̏̃ͦ̈́̾̀́̎͢҉̵̶͚̼͉͖̺̥͔͇̰̹̮͙͉̻̼̭̻͕̮͇ͨͬͪ͗̇̑̽͋̀̋̊͌ͧͨͭ̓̅͐ͥ̂̔̊ͧ͊҉̶̵̷̞̩̦̳̺̳̬̬̩̣̫͇̯̥͖͍͕̠̦̼̗ͯ̽͌̔ͪͯ́́͋̍ͨ̿̿̎͒ͤ̓̅̀͂ͧ͋̏ͫͣ̔͘͜͠͏̶̵̸̸̸̶̸̶̧̧̡̢̡̛̛̥̺͓̘̺͎̜̥͕͈̝̫͎̺̮̱̤̠̠͖̳̻̥̣̪͍͕͇̮͙̹̪͈̼̩̯̪͕̯̫̹̥͔͚͙̦̩͚̭̥͉̰̝̺͍̭̤̹̘̮̪͖͖͉̲̯͕̜̭̙̺̬̘͉̻͍̝̦͖̣̜͖̱͚̞̞̝̝̭̖͕͓͕͇̖̜̭̠͖̼̯̼̠̹͔̲͔̟͕̱̘̹̗͙̪̥̳͓̳͖̞̻͉͈̮̯̲̘̱̱̞̜̖̞̣̱ͮͧͫ͂͒ͤͣ̌̽ͨͪ͒̄̄̉̒̊ͩ̅͆̒̎̇̆͆ͪ̈́͛̉̍̏́̄̈́̽̔̍̎̂ͬ̆͗͌̔ͫ͆̀́͑̈́ͤ́ͯ̇ͧ̾͂̐̋̉̊ͦͥͫͧ͆ͨ̽̒̃͊̒̎͊̇̽̓̒ͬ̐̈́̀́́̍̈́̆̉ͭͪ̾ͭ̈́͛͑̽͐ͬ̈ͧͧ̍̐̑̓ͥ̔̾͐́̎̎͛ͮ͑ͤ̃̉ͦ̍͒ͩ̃̌̎͗̈́̐̉͐͐͌̄̀̓͆̉̌̎͂ͨͩͬ̾̊͋ͪ̎̑̀͘̚͘͘̚͘͘͘̕͟͟͢͟͟͟͜͝͠͞͝͝͝͝͡ͅͅͅͅ͏͏̡̡̛̙̣͉̪̬̗̳̱̤̥̪̮̮̟̥̠ͯ̓̂́͐̄̉̇ͣ́̚͜͟;̷̸̨̀͒̏̃ͦ̈́̾̀́̎͢҉̵̶͚̼͉͖̺̥͔͇̰̹̮͙͉̻̼̭̻͕̮͇ͨͬͪ͗̇̑̽͋̀̋̊͌ͧͨͭ̓̅͐ͥ̂̔̊ͧ͊҉̶̵̷̞̩̦̳̺̳̬̬̩̣̫͇̯̥͖͍͕̠̦̼̗ͯ̽͌̔ͪͯ́́͋̍ͨ̿̿̎͒ͤ̓̅̀͂ͧ͋̏ͫͣ̔͘͜͠͏̶̵̸̸̸̶̸̶̧̧̡̢̡̛̛̥̺͓̘̺͎̜̥͕͈̝̫͎̺̮̱̤̠̠͖̳̻̥̣̪͍͕͇̮͙̹̪͈̼̩̯̪͕̯̫̹̥͔͚͙̦̩͚̭̥͉̰̝̺͍̭̤̹̘̮̪͖͖͉̲̯͕̜̭̙̺̬̘͉̻͍̝̦͖̣̜͖̱͚̞̞̝̝̭̖͕͓͕͇̖̜̭̠͖̼̯̼̠̹͔̲͔̟͕̱̘̹̗͙̪̥̳͓̳͖̞̻͉͈̮̯̲̘̱̱̞̜̖̞̣̱ͮͧͫ͂͒ͤͣ̌̽ͨͪ͒̄̄̉̒̊ͩ̅͆̒̎̇̆͆ͪ̈́͛̉̍̏́̄̈́̽̔̍̎̂ͬ̆͗͌̔ͫ͆̀́͑̈́ͤ́ͯ̇ͧ̾͂̐̋̉̊ͦͥͫͧ͆ͨ̽̒̃͊̒̎͊̇̽̓̒ͬ̐̈́̀́́̍̈́̆̉ͭͪ̾ͭ̈́͛͑̽͐ͬ̈ͧͧ̍̐̑̓ͥ̔̾͐́̎̎͛ͮ͑ͤ̃̉ͦ̍͒ͩ̃̌̎͗̈́̐̉͐͐͌̄̀̓͆̉̌̎͂ͨͩͬ̾̊͋ͪ̎̑̀͘̚͘͘̚͘͘͘̕͟͟͢͟͟͟͜͝͠͞͝͝͝͝͡ͅͅͅͅ͏͏̡̡̛̙̣͉̪̬̗̳̱̤̥̪̮̮̟̥̠ͯ̓̂́͐̄̉̇ͣ́̚͜͟;̷̸̨̀͒̏̃ͦ̈́̾̀́̎͢҉̵̶͚̼͉͖̺̥͔͇̰̹̮͙͉̻̼̭̻͕̮͇ͨͬͪ͗̇̑̽͋̀̋̊͌ͧͨͭ̓̅͐ͥ̂̔̊ͧ͊҉̶̵̷̞̩̦̳̺̳̬̬̩̣̫͇̯̥͖͍͕̠̦̼̗ͯ̽͌̔ͪͯ́́͋̍ͨ̿̿̎͒ͤ̓̅̀͂ͧ͋̏ͫͣ̔͘͜͠͏̶̵̸̸̸̶̸̶̧̧̡̢̡̛̛̥̺͓̘̺͎̜̥͕͈̝̫͎̺̮̱̤̠̠͖̳̻̥̣̪͍͕͇̮͙̹̪͈̼̩̯̪͕̯̫̹̥͔͚͙̦̩͚̭̥͉̰̝̺͍̭̤̹̘̮̪͖͖͉̲̯͕̜̭̙̺̬̘͉̻͍̝̦͖̣̜͖̱͚̞̞̝̝̭̖͕͓͕͇̖̜̭̠͖̼̯̼̠̹͔̲͔̟͕̱̘̹̗͙̪̥̳͓̳͖̞̻͉͈̮̯̲̘̱̱̞̜̖̞̣̱ͮͧͫ͂͒ͤͣ̌̽ͨͪ͒̄̄̉̒̊ͩ̅͆̒̎̇̆͆ͪ̈́͛̉̍̏́̄̈́̽̔̍̎̂ͬ̆͗͌̔ͫ͆̀́͑̈́ͤ́ͯ̇ͧ̾͂̐̋̉̊ͦͥͫͧ͆ͨ̽̒̃͊̒̎͊̇̽̓̒ͬ̐̈́̀́́̍̈́̆̉ͭͪ̾ͭ̈́͛͑̽͐ͬ̈ͧͧ̍̐̑̓ͥ̔̾͐́̎̎͛ͮ͑ͤ̃̉ͦ̍͒ͩ̃̌̎͗̈́̐̉͐͐͌̄̀̓͆̉̌̎͂ͨͩͬ̾̊͋ͪ̎̑̀͘̚͘͘̚͘͘͘̕͟͟͢͟͟͟͜͝͠͞͝͝͝͝͡ͅͅͅͅ͏͏̡̡̛̙̣͉̪̬̗̳̱̤̥̪̮̮̟̥̠ͯ̓̂́͐̄̉̇ͣ́̚͜͟;̷̸̨̀͒̏̃ͦ̈́̾̀́̎͢҉̵̶͚̼͉͖̺̥͔͇̰̹̮͙͉̻̼̭̻͕̮͇ͨͬͪ͗̇̑̽͋̀̋̊͌ͧͨͭ̓̅͐ͥ̂̔̊ͧ͊҉̶̵̷̞̩̦̳̺̳̬̬̩̣̫͇̯̥͖͍͕̠̦̼̗ͯ̽͌̔ͪͯ́́͋̍ͨ̿̿̎͒ͤ̓̅̀͂ͧ͋̏ͫͣ̔͘͜͠͏̶̵̸̸̸̶̸̶̧̧̡̢̡̛̛̥̺͓̘̺͎̜̥͕͈̝̫͎̺̮̱̤̠̠͖̳̻̥̣̪͍͕͇̮͙̹̪͈̼̩̯̪͕̯̫̹̥͔͚͙̦̩͚̭̥͉̰̝̺͍̭̤̹̘̮̪͖͖͉̲̯͕̜̭̙̺̬̘͉̻͍̝̦͖̣̜͖̱͚̞̞̝̝̭̖͕͓͕͇̖̜̭̠͖̼̯̼̠̹͔̲͔̟͕̱̘̹̗͙̪̥̳͓̳͖̞̻͉͈̮̯̲̘̱̱̞̜̖̞̣̱ͮͧͫ͂͒ͤͣ̌̽ͨͪ͒̄̄̉̒̊ͩ̅͆̒̎̇̆͆ͪ̈́͛̉̍̏́̄̈́̽̔̍̎̂ͬ̆͗͌̔ͫ͆̀́͑̈́ͤ́ͯ̇ͧ̾͂̐̋̉̊ͦͥͫͧ͆ͨ̽̒̃͊̒̎͊̇̽̓̒ͬ̐̈́̀́́̍̈́̆̉ͭͪ̾ͭ̈́͛͑̽͐ͬ̈ͧͧ̍̐̑̓ͥ̔̾͐́̎̎͛ͮ͑ͤ̃̉ͦ̍͒ͩ̃̌̎͗̈́̐̉͐͐͌̄̀̓͆̉̌̎͂ͨͩͬ̾̊͋ͪ̎̑̀͘̚͘͘̚͘͘͘̕͟͟͢͟͟͟͜͝͠͞͝͝͝͝͡ͅͅͅͅ͏͏̡̡̛̙̣͉̪̬̗̳̱̤̥̪̮̮̟̥̠ͯ̓̂́͐̄̉̇ͣ́̚͜͟;̷̸̨̀͒̏̃ͦ̈́̾̀́̎͢҉̵̶͚̼͉͖̺̥͔͇̰̹̮͙͉̻̼̭̻͕̮͇ͨͬͪ͗̇̑̽͋̀̋̊͌ͧͨͭ̓̅͐ͥ̂̔̊ͧ͊҉̶̵̷̞̩̦̳̺̳̬̬̩̣̫͇̯̥͖͍͕̠̦̼̗ͯ̽͌̔ͪͯ́́͋̍ͨ̿̿̎͒ͤ̓̅̀͂ͧ͋̏ͫͣ̔͘͜͠͏̶̵̸̸̸̶̸̶̧̧̡̢̡̛̛̥̺͓̘̺͎̜̥͕͈̝̫͎̺̮̱̤̠̠͖̳̻̥̣̪͍͕͇̮͙̹̪͈̼̩̯̪͕̯̫̹̥͔͚͙̦̩͚̭̥͉̰̝̺͍̭̤̹̘̮̪͖͖͉̲̯͕̜̭̙̺̬̘͉̻͍̝̦͖̣̜͖̱͚̞̞̝̝̭̖͕͓͕͇̖̜̭̠͖̼̯̼̠̹͔̲͔̟͕̱̘̹̗͙̪̥̳͓̳͖̞̻͉͈̮̯̲̘̱̱̞̜̖̞̣̱ͮͧͫ͂͒ͤͣ̌̽ͨͪ͒̄̄̉̒̊ͩ̅͆̒̎̇̆͆ͪ̈́͛̉̍̏́̄̈́̽̔̍̎̂ͬ̆͗͌̔ͫ͆̀́͑̈́ͤ́ͯ̇ͧ̾͂̐̋̉̊ͦͥͫͧ͆ͨ̽̒̃͊̒̎͊̇̽̓̒ͬ̐̈́̀́́̍̈́̆̉ͭͪ̾ͭ̈́͛͑̽͐ͬ̈ͧͧ̍̐̑̓ͥ̔̾͐́̎̎͛ͮ͑ͤ̃̉ͦ̍͒ͩ̃̌̎͗̈́̐̉͐͐͌̄̀̓͆̉̌̎͂ͨͩͬ̾̊͋ͪ̎̑̀͘̚͘͘̚͘͘͘̕͟͟͢͟͟͟͜͝͠͞͝͝͝͝͡ͅͅͅͅ͏͏̡̡̛̙̣͉̪̬̗̳̱̤̥̪̮̮̟̥̠ͯ̓̂́͐̄̉̇ͣ́̚͜͟;̷̸̨̀͒̏̃ͦ̈́̾̀́̎͢҉̵̶͚̼͉͖̺̥͔͇̰̹̮͙͉̻̼̭̻͕̮͇ͨͬͪ͗̇̑̽͋̀̋̊͌ͧͨͭ̓̅͐ͥ̂̔̊ͧ͊҉̶̵̷̞̩̦̳̺̳̬̬̩̣̫͇̯̥͖͍͕̠̦̼̗ͯ̽͌̔ͪͯ́́͋̍ͨ̿̿̎͒ͤ̓̅̀͂ͧ͋̏ͫͣ̔͘͜͠͏̶̵̸̸̸̶̸̶̧̧̡̢̡̛̛̥̺͓̘̺͎̜̥͕͈̝̫͎̺̮̱̤̠̠͖̳̻̥̣̪͍͕͇̮͙̹̪͈̼̩̯̪͕̯̫̹̥͔͚͙̦̩͚̭̥͉̰̝̺͍̭̤̹̘̮̪͖͖͉̲̯͕̜̭̙̺̬̘͉̻͍̝̦͖̣̜͖̱͚̞̞̝̝̭̖͕͓͕͇̖̜̭̠͖̼̯̼̠̹͔̲͔̟͕̱̘̹̗͙̪̥̳͓̳͖̞̻͉͈̮̯̲̘̱̱̞̜̖̞̣̱ͮͧͫ͂͒ͤͣ̌̽ͨͪ͒̄̄̉̒̊ͩ̅͆̒̎̇̆͆ͪ̈́͛̉̍̏́̄̈́̽̔̍̎̂ͬ̆͗͌̔ͫ͆̀́͑̈́ͤ́ͯ̇ͧ̾͂̐̋̉̊ͦͥͫͧ͆ͨ̽̒̃͊̒̎͊̇̽̓̒ͬ̐̈́̀́́̍̈́̆̉ͭͪ̾ͭ̈́͛͑̽͐ͬ̈ͧͧ̍̐̑̓ͥ̔̾͐́̎̎͛ͮ͑ͤ̃̉ͦ̍͒ͩ̃̌̎͗̈́̐̉͐͐͌̄̀̓͆̉̌̎͂ͨͩͬ̾̊͋ͪ̎̑̀͘̚͘͘̚͘͘͘̕͟͟͢͟͟͟͜͝͠͞͝͝͝͝͡ͅͅͅͅ͏͏̡̡̛̙̣͉̪̬̗̳̱̤̥̪̮̮̟̥̠ͯ̓̂́͐̄̉̇ͣ́̚͜͟;̷̸̨̀͒̏̃ͦ̈́̾̀́̎͢҉̵̶͚̼͉͖̺̥͔͇̰̹̮͙͉̻̼̭̻͕̮͇ͨͬͪ͗̇̑̽͋̀̋̊͌ͧͨͭ̓̅͐ͥ̂̔̊ͧ͊҉̶̵̷̞̩̦̳̺̳̬̬̩̣̫͇̯̥͖͍͕̠̦̼̗ͯ̽͌̔ͪͯ́́͋̍ͨ̿̿̎͒ͤ̓̅̀͂ͧ͋̏ͫͣ̔͘͜͠͏̶̵̸̸̸̶̸̶̧̧̡̢̡̛̛̥̺͓̘̺͎̜̥͕͈̝̫͎̺̮̱̤̠̠͖̳̻̥̣̪͍͕͇̮͙̹̪͈̼̩̯̪͕̯̫̹̥͔͚͙̦̩͚̭̥͉̰̝̺͍̭̤̹̘̮̪͖͖͉̲̯͕̜̭̙̺̬̘͉̻͍̝̦͖̣̜͖̱͚̞̞̝̝̭̖͕͓͕͇̖̜̭̠͖̼̯̼̠̹͔̲͔̟͕̱̘̹̗͙̪̥̳͓̳͖̞̻͉͈̮̯̲̘̱̱̞̜̖̞̣̱ͮͧͫ͂͒ͤͣ̌̽ͨͪ͒̄̄̉̒̊ͩ̅͆̒̎̇̆͆ͪ̈́͛̉̍̏́̄̈́̽̔̍̎̂ͬ̆͗͌̔ͫ͆̀́͑̈́ͤ́ͯ̇ͧ̾͂̐̋̉̊ͦͥͫͧ͆ͨ̽̒̃͊̒̎͊̇̽̓̒ͬ̐̈́̀́́̍̈́̆̉ͭͪ̾ͭ̈́͛͑̽͐ͬ̈ͧͧ̍̐̑̓ͥ̔̾͐́̎̎͛ͮ͑ͤ̃̉ͦ̍͒ͩ̃̌̎͗̈́̐̉͐͐͌̄̀̓͆̉̌̎͂ͨͩͬ̾̊͋ͪ̎̑̀͘̚͘͘̚͘͘͘̕͟͟͢͟͟͟͜͝͠͞͝͝͝͝͡ͅͅͅͅ͏͏̡̡̛̙̣͉̪̬̗̳̱̤̥̪̮̮̟̥̠ͯ̓̂́͐̄̉̇ͣ́̚͜͟;̷̸̨̀͒̏̃ͦ̈́̾̀́̎͢҉̵̶͚̼͉͖̺̥͔͇̰̹̮͙͉̻̼̭̻͕̮͇ͨͬͪ͗̇̑̽͋̀̋̊͌ͧͨͭ̓̅͐ͥ̂̔̊ͧ͊҉̶̵̷̞̩̦̳̺̳̬̬̩̣̫͇̯̥͖͍͕̠̦̼̗ͯ̽͌̔ͪͯ́́͋̍ͨ̿̿̎͒ͤ̓̅̀͂ͧ͋̏ͫͣ̔͘͜͠͏̶̵̸̸̸̶̸̶̧̧̡̢̡̛̛̥̺͓̘̺͎̜̥͕͈̝̫͎̺̮̱̤̠̠͖̳̻̥̣̪͍͕͇̮͙̹̪͈̼̩̯̪͕̯̫̹̥͔͚͙̦̩͚̭̥͉̰̝̺͍̭̤̹̘̮̪͖͖͉̲̯͕̜̭̙̺̬̘͉̻͍̝̦͖̣̜͖̱͚̞̞̝̝̭̖͕͓͕͇̖̜̭̠͖̼̯̼̠̹͔̲͔̟͕̱̘̹̗͙̪̥̳͓̳͖̞̻͉͈̮̯̲̘̱̱̞̜̖̞̣̱ͮͧͫ͂͒ͤͣ̌̽ͨͪ͒̄̄̉̒̊ͩ̅͆̒̎̇̆͆ͪ̈́͛̉̍̏́̄̈́̽̔̍̎̂ͬ̆͗͌̔ͫ͆̀́͑̈́ͤ́ͯ̇ͧ̾͂̐̋̉̊ͦͥͫͧ͆ͨ̽̒̃͊̒̎͊̇̽̓̒ͬ̐̈́̀́́̍̈́̆̉ͭͪ̾ͭ̈́͛͑̽͐ͬ̈ͧͧ̍̐̑̓ͥ̔̾͐́̎̎͛ͮ͑ͤ̃̉ͦ̍͒ͩ̃̌̎͗̈́̐̉͐͐͌̄̀̓͆̉̌̎͂ͨͩͬ̾̊͋ͪ̎̑̀͘̚͘͘̚͘͘͘̕͟͟͢͟͟͟͜͝͠͞͝͝͝͝͡ͅͅͅͅ͏͏̡̡̛̙̣͉̪̬̗̳̱̤̥̪̮̮̟̥̠ͯ̓̂́͐̄̉̇ͣ́̚͜͟";

    String[] split = s.split("");

    StringBuilder sb = new StringBuilder();

    Random random = new Random();
    int length = split.length;
    for (int i = 0; i < length; i++) {
      int nextInt = random.nextInt(101);
      if (nextInt < 5) {
        sb.append(" ");
      }
      if (sb.length() % 700 == 0) {
        sb.append("\r\n");
      }
      sb.append(split[random.nextInt(length)]);
      if (sb.length() % 700 == 0) {
        sb.append("\r\n");
      }
    }
    sb.delete(0, sb.length());
    for (int i = 0; i < split.length; i++) {
      int nextInt = random.nextInt(101);
      sb.append(nextInt).append("\r\n");
    }
    
    File file = new File("C:\\Users\\hao19\\Documents\\a.txt");
//    if (!file.exists()) {
//      file.createNewFile();
//    }
    FileOutputStream fos = new FileOutputStream(file );
    fos.write(sb.toString().getBytes());
    fos.close();
  }
}
